In [1]:
import pandas as pd


people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
df = pd.DataFrame(people)

In [3]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [4]:
df.columns = ['first_name', 'last_name', 'email'] # sheicvala Colummnebis saxelebi mara cudi variantia ese shecvla

In [5]:
df.columns = [x.lower() for x in df.columns]

In [6]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [7]:
df.columns.str.replace(' ', '_')

Index(['first_name', 'last_name', 'email'], dtype='object')

In [8]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

this is comment?

In [9]:
df.rename(columns={'first_name': 'first', "last_name": 'last'}, inplace=True) # cvlis columnebis saxels romelic gadaecema dictionaris saxit columns{old_name: new_name}

In [10]:
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com'] # cvlis row-s Valuebs

In [11]:
df.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@email.com']

In [12]:
filt = (df['email'] == "JohnDoe@email.com")

In [13]:

df.loc[filt, 'last'] = "Jareth"

In [14]:
df['email'] = df['email'].str.lower() # Yvela emails gadaiyvans lowershi

In [15]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John   Jareth        johndoe@email.com

In [16]:
df['email'].apply(len) # Abrunebs EMail-ebis Length-s

0    23
1    17
2    17
Name: email, dtype: int64

In [17]:
def update_email(email):
    return email.upper()

.apply() methodi igebs funqcias parametrad

In [18]:
df['email'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [19]:
df.email = df['email'].apply(update_email)

In [20]:
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John   Jareth        JOHNDOE@EMAIL.COM

In [21]:
df.email = df['email'].apply(lambda x: x.lower()) # lambda funcqcis magaliti romelic gadaiyvans isev lowershi

In [22]:
df.apply(len, axis='columns') # daabrunebs ramdeni value aqvs Columns

0    3
1    3
2    3
dtype: int64

In [23]:
df.apply(pd.Series.min) # return minimal value for row

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [24]:
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [25]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     6     17

In [26]:
df.applymap(str.lower) # Mtlian dataFrame-s gadaiyvans lowershi

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john   jareth        johndoe@email.com

In [27]:
# df['first'] = df['first'].map({'corey': 'Chris', 'jane':'Mary'})

In [56]:
df['first'] = df['first'].replace({'corey': 'Chris', 'jane':'Mary'})

In [48]:
get_filterd_name = (df['first'] == 'Corey')

In [55]:
df.loc[get_filterd_name, 'first'] = 'CoreyChanged' # change firstName

In [59]:
df['first'] + ' ' + df['last']

0    CoreyChanged Schafer
1                Jane Doe
2             John Jareth
dtype: object

In [61]:
df['full_name'] = df['first'] + ' ' + df['last'] # Combines firt and last Columns Together as full_name

In [62]:
df

          first     last                    email             full_name
0  CoreyChanged  Schafer  coreymschafer@gmail.com  CoreyChanged Schafer
1          Jane      Doe        janedoe@email.com              Jane Doe
2          John   Jareth        johndoe@email.com           John Jareth

In [65]:
df.drop(columns=['first', 'last'], inplace=True) # shlis columnebs

              0        1
0  CoreyChanged  Schafer
1          Jane      Doe
2          John   Jareth

In [70]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [71]:
df

                     email             full_name         first     last
0  coreymschafer@gmail.com  CoreyChanged Schafer  CoreyChanged  Schafer
1        janedoe@email.com              Jane Doe          Jane      Doe
2        johndoe@email.com           John Jareth          John   Jareth

In [72]:
df.append({'first': 'Tony'}, ignore_index=True)  #amatebs rows

                     email             full_name         first     last
0  coreymschafer@gmail.com  CoreyChanged Schafer  CoreyChanged  Schafer
1        janedoe@email.com              Jane Doe          Jane      Doe
2        johndoe@email.com           John Jareth          John   Jareth
3                      NaN                   NaN          Tony      NaN

In [75]:
people2 = {
    "first": ["CoreyJS", 'JaneRuby'], 
    "last": ["Strk", 'Desr'], 
    "email": ["ohhooo@gmail.com", 'SexySexy@email.com']
}

In [76]:
df2 = pd.DataFrame(people2)

In [77]:
df2

      first  last               email
0   CoreyJS  Strk    ohhooo@gmail.com
1  JaneRuby  Desr  SexySexy@email.com

In [81]:
df.append(df2, ignore_index=True, sort=False) # ert dataFrame-s amatebs meores

                     email             full_name         first     last
0  coreymschafer@gmail.com  CoreyChanged Schafer  CoreyChanged  Schafer
1        janedoe@email.com              Jane Doe          Jane      Doe
2        johndoe@email.com           John Jareth          John   Jareth
3         ohhooo@gmail.com                   NaN       CoreyJS     Strk
4       SexySexy@email.com                   NaN      JaneRuby     Desr

In [83]:
df = df.append(df2, ignore_index=True, sort=False)

In [87]:
df.drop(index=4, inplace=True) # washlis 4 index rows

In [93]:
filt_gmail = df['email'].str.contains("gmail") # Filtravs im emailebs romelshic shedis gmail

In [96]:
df.drop(index=df[filt_gmail].index, inplace=True) # washlis yvela rows romelic moyveba filt_gmail-shi

In [97]:
df

               email    full_name first    last
1  janedoe@email.com     Jane Doe  Jane     Doe
2  johndoe@email.com  John Jareth  John  Jareth